---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.ContinuousrailEndTopExtension
source: html/17b3d505-192e-4fec-17cb-5a43647766a9.htm
---
# Autodesk.Revit.DB.GroupTypeId.ContinuousrailEndTopExtension Property

Extension (End/Top).

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousrailEndTopExtension { get; }
```